#バトルに関するパラメータのマクロ

# --- パラメータ設定 ---
PLAYER_MAX_HP = 30
ENEMY_MAX_HP = 5

# ステージごとの敵の攻撃力
ENEMY_POWER_LIST = [2, 4, 6] 

# --- カードの効果 ---
SWORD_POWER = 1   # 剣1枚で溜まる攻撃力
GUARD_POWER = 1   #ガードでのHP増強量
ENEMY_POWER = 2   # 敵のターンでの攻撃力

# --- デッキ (1:剣, 2:ガード, 3:ドクロ) ---
DECK_LIST = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 
             1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 
             1, 1, 1, 1, 1, 1, 1,
             2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
             3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3] 